// Напишите программу, которая на вход принимает одно число (N), 
// а на выходе показывает все целые числа в промежутке от -N до N.
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4" 
// 2 -> " -2, -1, 0, 1, 2"

// System.Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());
// if (number<0){
//     number = number * -1;
// }
// for(int i = -number; i <= number; i++)
// {
//     System.Console.Write(i+" ");
// }

//  Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает последнюю цифру этого числа.
// 456 -> 6
// 782 -> 2
// 918 -> 8

// System.Console.WriteLine("Введите число  ");
// int number = Convert.ToInt32(Console.ReadLine());
// if (number>99 && number<1000)
// {
//     int x = number%10;
// Console.WriteLine(x);
// }
// else 
// {
//     System.Console.WriteLine("Введено невернео число");
// }



